EDT/УТ/src/Documents/мгНачисленияПоСдельнойОплате/мгНачисленияПоСдельнойОплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгНачисленияПоСдельнойОплате</name>
  <registerRecords>AccumulationRegister.мгЗарплатаНачисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаПодъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоФиксТарифу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/РаботникиОрганизации/РаботникиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетВПроектнойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/AccumulationRegisters/РасчетЗарплаты/РасчетЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетЗарплаты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подъём</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДоставкаБП</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидТарифаРасчетаЗП</name>
    <type>
      <types>CatalogRef.ВидыТарифовРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЭкипажа</name>
    <type>
      <types>EnumRef.ТипыТарифовРасчетаЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.ТипыТранспортаДляРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаёмныйЭкипаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаУслугСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Территориальность</name>
    <type>
      <types>EnumRef.ТерриториальностьДоставок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВыполненияДоставки</name>
    <type>
      <types>EnumRef.ВидыВыполненияДоставокЭкипажами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетПоМинимальнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъёмЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗаказаДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравилаОпределенияКатегорииЗаказаДляЗП</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/InformationRegisters/мгНачислениеПоИсключениям/мгНачислениеПоИсключениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгНачислениеПоИсключениям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/мгЗначенияКатегорийЗаказов/мгЗначенияКатегорийЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгЗначенияКатегорийЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВесЗаказаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключительноОт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВесЗаказаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключительноДо</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/мгТарифыОсновныхНачислений/мгТарифыОсновныхНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгТарифыОсновныхНачислений</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Регион</name>
    <comment>Регион</comment>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗаказа</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
      <types>CatalogRef.мгКатегорииЗабора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Территориальность</name>
    <type>
      <types>CatalogRef.мгЛокализацииЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидТарифа</name>
    <type>
      <types>EnumRef.ТипыТарифовРасчетаЗарплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/мгТарифыФрахт/мгТарифыФрахт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгТарифыФрахт</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Условие</name>
    <type>
      <types>EnumRef.мгУсловияФрахт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/мгСоответствиеТочкиДоставкиЗоне/мгСоответствиеТочкиДоставкиЗоне.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгСоответствиеТочкиДоставкиЗоне</name>
  <resources>
    <name>Зона</name>
    <type>
      <types>CatalogRef.мгЛокализацииЗаказов</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаДоставки</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыЗаказов/ТипыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказов</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Обмен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыТарифовРасчетаЗарплаты/ТипыТарифовРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТарифовРасчетаЗарплаты</name>
  <enumValues>
    <name>АрендованныйТранспорт</name>
  </enumValues>
  <enumValues>
    <name>ЭкипажБезЭкспедитора</name>
  </enumValues>
  <enumValues>
    <name>ЭкипажПолный</name>
  </enumValues>
  <enumValues>
    <name>ЭкипажПолныйЭкспедитор</name>
  </enumValues>
  <enumValues>
    <name>ПешийКурьер</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/мгНачисленияПоСдельнойОплате/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Данные.Количество() <> 0 тогда
		От = Вопрос("Табличная часть не пуста. Перезаполнить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если От = КодВозвратаДиалога.Да Тогда
			Объект.Данные.Очистить();
		Иначе
			Возврат;
		КонецеСли;	
	КонецЕсли;	
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	               |	МАКСИМУМ(РаботникиОрганизации.Период) КАК Период
	               |ПОМЕСТИТЬ вр_РаботникиОрганизации
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаботникиОрганизации.Сотрудник
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вр_РаботникиОрганизации.Сотрудник КАК Сотрудник,
	               |	вр_РаботникиОрганизации.Период КАК Период,
	               |	РаботникиОрганизации.Организация КАК Организация,
	               |	РаботникиОрганизации.Состояние КАК Состояние,
	               |	РаботникиОрганизации.Должность КАК Должность
	               |ПОМЕСТИТЬ втРаботники
	               |ИЗ
	               |	вр_РаботникиОрганизации КАК вр_РаботникиОрганизации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	               |		ПО вр_РаботникиОрганизации.Сотрудник = РаботникиОрганизации.Сотрудник
	               |			И вр_РаботникиОрганизации.Период = РаботникиОрганизации.Период
	               |ГДЕ
	               |	НЕ РаботникиОрганизации.Регистратор ССЫЛКА Документ.УвольнениеСРаботыИзОрганизация
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетЗарплатыОбороты.Регион КАК Регион,
	               |	РасчетЗарплатыОбороты.ФизЛицо КАК ФизЛицо,
	               |	РасчетЗарплатыОбороты.Доставка КАК Заказ,
	               |	РасчетЗарплатыОбороты.ПодъёмОборот КАК ПодъёмОборот
	               |ПОМЕСТИТЬ втРасчетЗППодъем
	               |ИЗ
	               |	РегистрНакопления.РасчетЗарплаты.Обороты(&НачалоПериода, &КонецПериода, , Регион = &ТерминалДоставки) КАК РасчетЗарплатыОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ФизЛицо,
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗакрытиеЗаказовЗаказы.Реализация.Номер КАК Номер,
	               |	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	               |	ДополнительныеПараметрыЗаказа.ТарифицируемыйВес КАК ТарифицируемыйВес1
	               |ПОМЕСТИТЬ втИзРС
	               |ИЗ
	               |	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	               |		ПО ЗакрытиеЗаказовЗаказы.Реализация = ДополнительныеПараметрыЗаказа.Заказ
	               |ГДЕ
	               |	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	               |	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	               |	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	               |	И (ЗакрытиеЗаказовЗаказы.Закрыть
	               |			ИЛИ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗакрытиеЗаказовЗаказы.Реализация.Номер КАК Номер,
	               |	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	               |	ЗакрытиеЗаказовЗаказы.ТарифицируемыйВес КАК ТарифицируемыйВес
	               |ПОМЕСТИТЬ втИзЗакрытия
	               |ИЗ
	               |	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	               |ГДЕ
	               |	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	               |	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	               |	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	               |	И (ЗакрытиеЗаказовЗаказы.Закрыть
	               |			ИЛИ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом))
	               |	И ЗакрытиеЗаказовЗаказы.ТарифицируемыйВес <> 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИзРС.Заказ.Номер КАК ЗаказНомер,
	               |	втИзРС.Заказ КАК Заказ,
	               |	ЕСТЬNULL(втИзРС.ТарифицируемыйВес1, 0) КАК ТарВесИзРС
	               |ПОМЕСТИТЬ втИзРСсВесом
	               |ИЗ
	               |	втИзРС КАК втИзРС
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИзРСсВесом.ЗаказНомер КАК ЗаказНомер,
	               |	втИзРСсВесом.Заказ КАК Заказ,
	               |	ВЫБОР
	               |		КОГДА втИзРСсВесом.ТарВесИзРС = 0
	               |			ТОГДА ЕСТЬNULL(втИзЗакрытия.ТарифицируемыйВес, 0)
	               |		ИНАЧЕ втИзРСсВесом.ТарВесИзРС
	               |	КОНЕЦ КАК ТарифицируемыйВес
	               |ПОМЕСТИТЬ втИзРСиЗакрытие
	               |ИЗ
	               |	втИзРСсВесом КАК втИзРСсВесом
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втИзЗакрытия КАК втИзЗакрытия
	               |		ПО втИзРСсВесом.Заказ = втИзЗакрытия.Заказ
	               |			И (ВЫБОР
	               |				КОГДА втИзРСсВесом.ТарВесИзРС = 0
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИзРСиЗакрытие.ЗаказНомер КАК ЗаказНомер,
	               |	втИзРСиЗакрытие.Заказ КАК Заказ,
	               |	ВЫБОР
	               |		КОГДА втИзРСиЗакрытие.ТарифицируемыйВес = 0
	               |			ТОГДА РеализацияТоваровУслуг.ОбщийВес
	               |		ИНАЧЕ втИзРСиЗакрытие.ТарифицируемыйВес
	               |	КОНЕЦ КАК ТарифицируемыйВес
	               |ПОМЕСТИТЬ втДоставкаЗаказВес
	               |ИЗ
	               |	втИзРСиЗакрытие КАК втИзРСиЗакрытие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО втИзРСиЗакрытие.Заказ = РеализацияТоваровУслуг.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	мгНачислениеПоИсключениям.Сотрудник КАК Сотрудник,
	               |	СУММА(мгНачислениеПоИсключениям.Тариф) КАК Тариф,
	               |	мгНачислениеПоИсключениям.Период КАК Период
	               |ПОМЕСТИТЬ втФиксНачисленияПоДатам
	               |ИЗ
	               |	РегистрСведений.мгНачислениеПоИсключениям КАК мгНачислениеПоИсключениям
	               |ГДЕ
	               |	мгНачислениеПоИсключениям.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И мгНачислениеПоИсключениям.Терминал = &ТерминалДоставки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	мгНачислениеПоИсключениям.Сотрудник,
	               |	мгНачислениеПоИсключениям.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втФиксНачисленияПоДатам.Сотрудник КАК Сотрудник,
	               |	СУММА(втФиксНачисленияПоДатам.Тариф) КАК Тариф
	               |ПОМЕСТИТЬ втФиксНачисления
	               |ИЗ
	               |	втФиксНачисленияПоДатам КАК втФиксНачисленияПоДатам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втФиксНачисленияПоДатам.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗакрытиеЗаказовЗаказы.Ссылка КАК Ссылка,
	               |	ЗакрытиеЗаказовЗаказы.НомерСтроки КАК НомерСтроки,
	               |	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	               |	ЗакрытиеЗаказовЗаказы.ТипЗаказа КАК ТипЗаказа,
	               |	ЗакрытиеЗаказовЗаказы.Водитель КАК Сотрудник,
	               |	ВЫБОР
	               |		КОГДА ЗакрытиеЗаказовЗаказы.Водитель.Наемный
	               |				И ЗакрытиеЗаказовЗаказы.Водитель.ПешийКурьер
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ПешийКурьер)
	               |		КОГДА ЗакрытиеЗаказовЗаказы.Водитель.Наемный
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.АрендованныйТранспорт)
	               |		КОГДА ЗакрытиеЗаказовЗаказы.Экспедитор = ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажБезЭкспедитора)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажПолный)
	               |	КОНЕЦ КАК ВидТарифаДоставкаЗабор,
	               |	ЗакрытиеЗаказовЗаказы.ФрахтЧасов КАК ФрахтЧасов,
	               |	ЗакрытиеЗаказовЗаказы.Доставка КАК Доставка,
	               |	ЗакрытиеЗаказовЗаказы.ВыгруженныйОбъем КАК ОбъёмЗабора,
	               |	ЗакрытиеЗаказовЗаказы.ВидПодъемаНаЭтаж КАК ВидПодъемаНаЭтаж,
	               |	ЗакрытиеЗаказовЗаказы.Этаж КАК Этаж,
	               |	ЗакрытиеЗаказовЗаказы.ПодъемВодитель КАК ПодъемВодитель,
	               |	ЗакрытиеЗаказовЗаказы.РезультатДоставки КАК РезультатДоставки,
	               |	ВЫБОР
	               |		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	               |			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	               |		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	               |	КОНЕЦ КАК ПричинаНевыполнения,
	               |	ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя КАК ДанныеМПВодителя,
	               |	ЗакрытиеЗаказовЗаказы.Закрыть КАК Закрыть,
	               |	ЗакрытиеЗаказовЗаказы.Контрагент КАК Контрагент,
	               |	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия КАК ДатаЗакрытия
	               |ПОМЕСТИТЬ втДанныеЗаказов1
	               |ИЗ
	               |	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	               |ГДЕ
	               |	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	               |			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	               |			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	               |	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	               |	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	               |	И НЕ ЗакрытиеЗаказовЗаказы.Ссылка.ПометкаУдаления
	               |	И НЕ (ЗакрытиеЗаказовЗаказы.Водитель, ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия) В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					втФиксНачисленияПоДатам.Сотрудник КАК Сотрудник,
	               |					втФиксНачисленияПоДатам.Период КАК Период
	               |				ИЗ
	               |					втФиксНачисленияПоДатам КАК втФиксНачисленияПоДатам)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗакрытиеЗаказовЗаказы.Ссылка,
	               |	ЗакрытиеЗаказовЗаказы.НомерСтроки,
	               |	ЗакрытиеЗаказовЗаказы.Реализация,
	               |	ЗакрытиеЗаказовЗаказы.ТипЗаказа,
	               |	ЗакрытиеЗаказовЗаказы.Экспедитор,
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыТарифовРасчетаЗарплаты.ЭкипажПолныйЭкспедитор),
	               |	ЗакрытиеЗаказовЗаказы.ФрахтЧасов,
	               |	ЗакрытиеЗаказовЗаказы.Доставка,
	               |	ЗакрытиеЗаказовЗаказы.ВыгруженныйОбъем,
	               |	ЗакрытиеЗаказовЗаказы.ВидПодъемаНаЭтаж,
	               |	ЗакрытиеЗаказовЗаказы.Этаж,
	               |	ЗакрытиеЗаказовЗаказы.ПодъемВодитель,
	               |	ЗакрытиеЗаказовЗаказы.РезультатДоставки,
	               |	ВЫБОР
	               |		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	               |			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	               |		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	               |	КОНЕЦ,
	               |	ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя,
	               |	ЗакрытиеЗаказовЗаказы.Закрыть,
	               |	ЗакрытиеЗаказовЗаказы.Контрагент,
	               |	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия
	               |ИЗ
	               |	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	               |ГДЕ
	               |	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	               |			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	               |			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	               |	И ЗакрытиеЗаказовЗаказы.Экспедитор <> ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)
	               |	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &ТерминалДоставки
	               |	И НЕ ЗакрытиеЗаказовЗаказы.Ссылка.ПометкаУдаления
	               |	И НЕ (ЗакрытиеЗаказовЗаказы.Экспедитор, ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия) В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					втФиксНачисленияПоДатам.Сотрудник КАК Сотрудник,
	               |					втФиксНачисленияПоДатам.Период КАК Период
	               |				ИЗ
	               |					втФиксНачисленияПоДатам КАК втФиксНачисленияПоДатам)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка,
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеЗаказов.Ссылка КАК Ссылка,
	               |	втДанныеЗаказов.Заказ КАК Заказ,
	               |	КОЛИЧЕСТВО(втДанныеЗаказов.Заказ) КАК КолВоВЭкипаже
	               |ПОМЕСТИТЬ втКолВоВЭкипаже
	               |ИЗ
	               |	втДанныеЗаказов1 КАК втДанныеЗаказов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втДанныеЗаказов.Ссылка,
	               |	втДанныеЗаказов.Заказ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка,
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеЗаказов1.Ссылка КАК Ссылка,
	               |	втДанныеЗаказов1.НомерСтроки КАК НомерСтроки,
	               |	втДанныеЗаказов1.Заказ КАК Заказ,
	               |	втДанныеЗаказов1.ТипЗаказа КАК ТипЗаказа,
	               |	втДанныеЗаказов1.Сотрудник КАК Сотрудник,
	               |	втДанныеЗаказов1.ВидТарифаДоставкаЗабор КАК ВидТарифаДоставкаЗабор,
	               |	втДанныеЗаказов1.ФрахтЧасов КАК ФрахтЧасов,
	               |	втДанныеЗаказов1.Доставка КАК Доставка,
	               |	втДоставкаЗаказВес.ТарифицируемыйВес КАК ТарифицируемыйВес,
	               |	втДанныеЗаказов1.ОбъёмЗабора КАК ОбъёмЗабора,
	               |	втДанныеЗаказов1.ВидПодъемаНаЭтаж КАК ВидПодъемаНаЭтаж,
	               |	втДанныеЗаказов1.Этаж КАК Этаж,
	               |	втДанныеЗаказов1.ПодъемВодитель КАК ПодъемВодитель,
	               |	втКолВоВЭкипаже.КолВоВЭкипаже КАК КолВоВЭкипаже,
	               |	втРасчетЗППодъем.ПодъёмОборот КАК СуммаПодъем,
	               |	втДанныеЗаказов1.Контрагент КАК Контрагент,
	               |	втДанныеЗаказов1.ДатаЗакрытия КАК ДатаЗакрытия
	               |ПОМЕСТИТЬ втДанныеЗаказов
	               |ИЗ
	               |	втДанныеЗаказов1 КАК втДанныеЗаказов1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКолВоВЭкипаже КАК втКолВоВЭкипаже
	               |		ПО втДанныеЗаказов1.Ссылка = втКолВоВЭкипаже.Ссылка
	               |			И втДанныеЗаказов1.Заказ = втКолВоВЭкипаже.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втДоставкаЗаказВес КАК втДоставкаЗаказВес
	               |		ПО втДанныеЗаказов1.Заказ = втДоставкаЗаказВес.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втРасчетЗППодъем КАК втРасчетЗППодъем
	               |		ПО втДанныеЗаказов1.Заказ = втРасчетЗППодъем.Заказ
	               |			И втДанныеЗаказов1.Сотрудник = втРасчетЗППодъем.ФизЛицо
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА втДанныеЗаказов1.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	               |				ТОГДА ВЫБОР
	               |						КОГДА втДанныеЗаказов1.ДанныеМПВодителя.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда)
	               |							ТОГДА ЛОЖЬ
	               |						ИНАЧЕ ИСТИНА
	               |					КОНЕЦ
	               |			КОГДА (втДанныеЗаказов1.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	               |					ИЛИ втДанныеЗаказов1.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ПустаяСсылка)
	               |					ИЛИ втДанныеЗаказов1.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
	               |					И втДанныеЗаказов1.Закрыть
	               |				ТОГДА ИСТИНА
	               |			КОГДА втДанныеЗаказов1.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	мгЗначенияКатегорийЗаказовСрезПоследних.Категория КАК Категория,
	               |	мгЗначенияКатегорийЗаказовСрезПоследних.ВесЗаказаОт КАК ВесЗаказаОт,
	               |	мгЗначенияКатегорийЗаказовСрезПоследних.ВключительноОт КАК ВключительноОт,
	               |	мгЗначенияКатегорийЗаказовСрезПоследних.ВесЗаказаДо КАК ВесЗаказаДо,
	               |	мгЗначенияКатегорийЗаказовСрезПоследних.ВключительноДо КАК ВключительноДо
	               |ПОМЕСТИТЬ втЗначенияКатегорииЗаказа
	               |ИЗ
	               |	РегистрСведений.мгЗначенияКатегорийЗаказов.СрезПоследних(&КонецПериода, ) КАК мгЗначенияКатегорийЗаказовСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Категория
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	мгТарифыОсновныхНачисленийСрезПоследних.Регион КАК Регион,
	               |	мгТарифыОсновныхНачисленийСрезПоследних.ТипЗаказа КАК ТипЗаказа,
	               |	мгТарифыОсновныхНачисленийСрезПоследних.КатегорияЗаказа КАК КатегорияЗаказа,
	               |	мгТарифыОсновныхНачисленийСрезПоследних.Территориальность КАК Территориальность,
	               |	мгТарифыОсновныхНачисленийСрезПоследних.ВидТарифа КАК ВидТарифа,
	               |	мгТарифыОсновныхНачисленийСрезПоследних.Значение КАК Значение
	               |ПОМЕСТИТЬ втТарифыОсновные
	               |ИЗ
	               |	РегистрСведений.мгТарифыОсновныхНачислений.СрезПоследних(&КонецПериода, ) КАК мгТарифыОсновныхНачисленийСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ТипЗаказа,
	               |	КатегорияЗаказа,
	               |	Территориальность,
	               |	ВидТарифа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт) КАК ТипЗаказа,
	               |	мгТарифыФрахтСрезПоследних.Условие КАК Условие,
	               |	мгТарифыФрахтСрезПоследних.Значение КАК Значение
	               |ПОМЕСТИТЬ втТарифыФрахт
	               |ИЗ
	               |	РегистрСведений.мгТарифыФрахт.СрезПоследних(&КонецПериода, ) КАК мгТарифыФрахтСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ТипЗаказа,
	               |	Условие
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втПоказателиЗаказа.Заказ КАК Заказ,
	               |	ЗаборТовара.ТочкаДоставки КАК ТочкаДоставки
	               |ПОМЕСТИТЬ втЗаборФрахтТД
	               |ИЗ
	               |	втДанныеЗаказов КАК втПоказателиЗаказа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаборТовара КАК ЗаборТовара
	               |		ПО втПоказателиЗаказа.Заказ = ЗаборТовара.Ссылка
	               |ГДЕ
	               |	втПоказателиЗаказа.Заказ ССЫЛКА Документ.ЗаборТовара
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втПоказателиЗаказа.Заказ,
	               |	Фрахт.ТочкаДоставки
	               |ИЗ
	               |	втДанныеЗаказов КАК втПоказателиЗаказа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Фрахт КАК Фрахт
	               |		ПО втПоказателиЗаказа.Заказ = Фрахт.Ссылка
	               |ГДЕ
	               |	втПоказателиЗаказа.Заказ ССЫЛКА Документ.Фрахт
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втДанныеЗаказов.Заказ КАК Заказ,
	               |	новаТочкиДоставки.Ссылка КАК ТочкаДоставки
	               |ПОМЕСТИТЬ втЗаказыТД
	               |ИЗ
	               |	втДанныеЗаказов КАК втДанныеЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.новаТочкиДоставки КАК новаТочкиДоставки
	               |		ПО втДанныеЗаказов.Доставка.ТочкаПрибытия = новаТочкиДоставки.Ссылка
	               |ГДЕ
	               |	втДанныеЗаказов.Заказ ССЫЛКА Документ.РеализацияТоваровУслуг
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	втЗаборФрахтТД.Заказ,
	               |	втЗаборФрахтТД.ТочкаДоставки
	               |ИЗ
	               |	втЗаборФрахтТД КАК втЗаборФрахтТД
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втЗаказыТД.Заказ КАК Заказ,
	               |	мгСоответствиеТочкиДоставкиЗоне.Зона КАК Территориальность,
	               |	втЗаказыТД.ТочкаДоставки КАК ТочкаДоставки
	               |ПОМЕСТИТЬ втЗаказЗона
	               |ИЗ
	               |	втЗаказыТД КАК втЗаказыТД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мгСоответствиеТочкиДоставкиЗоне КАК мгСоответствиеТочкиДоставкиЗоне
	               |		ПО втЗаказыТД.ТочкаДоставки = мгСоответствиеТочкиДоставкиЗоне.ТочкаДоставки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втДанныеЗаказов.Заказ КАК Заказ,
	               |	втДанныеЗаказов.ТарифицируемыйВес КАК ТарифицируемыйВес,
	               |	втЗначенияКатегорииЗаказа.Категория КАК Категория,
	               |	втЗначенияКатегорииЗаказа.ВесЗаказаОт КАК ВесЗаказаОт,
	               |	втЗначенияКатегорииЗаказа.ВесЗаказаДо КАК ВесЗаказаДо
	               |ПОМЕСТИТЬ втЗаказКатегория
	               |ИЗ
	               |	втДанныеЗаказов КАК втДанныеЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втЗначенияКатегорииЗаказа КАК втЗначенияКатегорииЗаказа
	               |		ПО (ВЫБОР
	               |				КОГДА втДанныеЗаказов.ТарифицируемыйВес МЕЖДУ втЗначенияКатегорииЗаказа.ВесЗаказаОт И втЗначенияКатегорииЗаказа.ВесЗаказаДо
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втДанныеЗаказов.Заказ КАК Заказ,
	               |	втДанныеЗаказов.ОбъёмЗабора КАК ОбъёмЗабора,
	               |	мгКатегорииЗабора.Ссылка КАК КатегорияЗабора
	               |ПОМЕСТИТЬ втЗаказКатегорияЗабора
	               |ИЗ
	               |	втДанныеЗаказов КАК втДанныеЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.мгКатегорииЗабора КАК мгКатегорииЗабора
	               |		ПО (ВЫБОР
	               |				КОГДА втДанныеЗаказов.ОбъёмЗабора МЕЖДУ мгКатегорииЗабора.ОбъёмОт И мгКатегорииЗабора.ОбъёмДо
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |ГДЕ
	               |	втДанныеЗаказов.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	               |	И НЕ мгКатегорииЗабора.ПометкаУдаления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеЗаказов.Ссылка КАК Ссылка,
	               |	втДанныеЗаказов.НомерСтроки КАК НомерСтроки,
	               |	втДанныеЗаказов.Заказ КАК Заказ,
	               |	втДанныеЗаказов.Сотрудник КАК Сотрудник,
	               |	втДанныеЗаказов.ТипЗаказа КАК ТипЗаказа,
	               |	втЗаказЗона.Территориальность КАК Территориальность,
	               |	втДанныеЗаказов.ВидТарифаДоставкаЗабор КАК ВидТарифаДоставкаЗабор,
	               |	втДанныеЗаказов.ФрахтЧасов КАК ФрахтЧасов,
	               |	втДанныеЗаказов.ТарифицируемыйВес КАК ТарифицируемыйВес,
	               |	ВЫБОР
	               |		КОГДА втДанныеЗаказов.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	               |			ТОГДА втЗаказКатегорияЗабора.КатегорияЗабора
	               |		КОГДА втДанныеЗаказов.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт)
	               |			ТОГДА ВЫБОР
	               |					КОГДА втДанныеЗаказов.ФрахтЧасов < 6
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.мгУсловияФрахт.Менее6Часов)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.мгУсловияФрахт.ЗаКаждыйЧасПосле6)
	               |				КОНЕЦ
	               |		ИНАЧЕ втЗаказКатегория.Категория
	               |	КОНЕЦ КАК Категория,
	               |	втДанныеЗаказов.ВидПодъемаНаЭтаж КАК ВидПодъемаНаЭтаж,
	               |	втДанныеЗаказов.Этаж КАК Этаж,
	               |	втДанныеЗаказов.ОбъёмЗабора КАК ОбъёмЗабора,
	               |	втЗаказЗона.ТочкаДоставки КАК ТочкаДоставки,
	               |	втДанныеЗаказов.КолВоВЭкипаже КАК КолВоВЭкипаже,
	               |	втДанныеЗаказов.СуммаПодъем КАК СуммаПодъем,
	               |	втДанныеЗаказов.Контрагент КАК Контрагент,
	               |	втДанныеЗаказов.ДатаЗакрытия КАК ДатаЗакрытия
	               |ПОМЕСТИТЬ втПоказатели
	               |ИЗ
	               |	втДанныеЗаказов КАК втДанныеЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказЗона КАК втЗаказЗона
	               |		ПО втДанныеЗаказов.Заказ = втЗаказЗона.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказКатегория КАК втЗаказКатегория
	               |		ПО втДанныеЗаказов.Заказ = втЗаказКатегория.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказКатегорияЗабора КАК втЗаказКатегорияЗабора
	               |		ПО втДанныеЗаказов.Заказ = втЗаказКатегорияЗабора.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втПоказатели.Ссылка КАК Ссылка,
	               |	втПоказатели.НомерСтроки КАК НомерСтроки,
	               |	втПоказатели.Заказ КАК Заказ,
	               |	ЕСТЬNULL(втПоказатели.Сотрудник, втФиксНачисления.Сотрудник) КАК Сотрудник,
	               |	втПоказатели.ТипЗаказа КАК ТипЗаказа,
	               |	втПоказатели.Категория КАК Категория,
	               |	втПоказатели.Территориальность КАК Территориальность,
	               |	втПоказатели.ВидТарифаДоставкаЗабор КАК ВидТарифаДоставкаЗабор,
	               |	втПоказатели.ТарифицируемыйВес КАК ТарифицируемыйВес,
	               |	втПоказатели.ОбъёмЗабора КАК ОбъёмЗабора,
	               |	втПоказатели.ФрахтЧасов КАК ФрахтЧасов,
	               |	втПоказатели.ВидПодъемаНаЭтаж КАК ВидПодъемаНаЭтаж,
	               |	втПоказатели.Этаж КАК Этаж,
	               |	ВЫБОР
	               |		КОГДА втПоказатели.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	               |				ИЛИ втПоказатели.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	               |			ТОГДА ВЫБОР
	               |					КОГДА втТарифыОсновные.Значение ЕСТЬ NULL
	               |						ТОГДА 0
	               |					ИНАЧЕ втТарифыОсновные.Значение
	               |				КОНЕЦ
	               |		КОГДА втПоказатели.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт)
	               |			ТОГДА ВЫБОР
	               |					КОГДА втПоказатели.Категория = ЗНАЧЕНИЕ(Перечисление.мгУсловияФрахт.Менее6Часов)
	               |						ТОГДА втТарифыФрахт.Значение
	               |					КОГДА втПоказатели.Категория = ЗНАЧЕНИЕ(Перечисление.мгУсловияФрахт.ЗаКаждыйЧасПосле6)
	               |						ТОГДА втПоказатели.ФрахтЧасов * втТарифыФрахт.Значение
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Тариф,
	               |	втПоказатели.ТочкаДоставки КАК ТочкаДоставки,
	               |	втПоказатели.КолВоВЭкипаже КАК КолВоВЭкипаже,
	               |	втПоказатели.СуммаПодъем КАК СуммаПодъем,
	               |	втФиксНачисления.Тариф КАК ФиксТариф
	               |ПОМЕСТИТЬ втСумма
	               |ИЗ
	               |	втПоказатели КАК втПоказатели
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втТарифыОсновные КАК втТарифыОсновные
	               |		ПО втПоказатели.ТипЗаказа = втТарифыОсновные.ТипЗаказа
	               |			И втПоказатели.Территориальность = втТарифыОсновные.Территориальность
	               |			И втПоказатели.ВидТарифаДоставкаЗабор = втТарифыОсновные.ВидТарифа
	               |			И втПоказатели.Категория = втТарифыОсновные.КатегорияЗаказа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втТарифыФрахт КАК втТарифыФрахт
	               |		ПО втПоказатели.ТипЗаказа = втТарифыФрахт.ТипЗаказа
	               |			И втПоказатели.Категория = втТарифыФрахт.Условие
	               |		ПОЛНОЕ СОЕДИНЕНИЕ втФиксНачисления КАК втФиксНачисления
	               |		ПО втПоказатели.Сотрудник = втФиксНачисления.Сотрудник
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втСумма.Ссылка КАК Ссылка,
	               |	втСумма.НомерСтроки КАК НомерСтроки,
	               |	втСумма.Заказ КАК Заказ,
	               |	ЕСТЬNULL(втСумма.Сотрудник, втРаботники.Сотрудник) КАК Сотрудник,
	               |	втРаботники.Должность КАК Должность,
	               |	втРаботники.Организация КАК Организация,
	               |	втСумма.ТипЗаказа КАК ТипЗаказа,
	               |	втСумма.Категория КАК Категория,
	               |	втСумма.Территориальность КАК Территориальность,
	               |	втСумма.ВидТарифаДоставкаЗабор КАК ВидТарифаДоставкаЗабор,
	               |	втСумма.ТарифицируемыйВес КАК ТарифицируемыйВес,
	               |	втСумма.ОбъёмЗабора КАК ОбъёмЗабора,
	               |	втСумма.ФрахтЧасов КАК ФрахтЧасов,
	               |	втСумма.ВидПодъемаНаЭтаж КАК ВидПодъемаНаЭтаж,
	               |	втСумма.Этаж КАК Этаж,
	               |	ЕСТЬNULL(втСумма.Тариф, 0) КАК Тариф,
	               |	ЕСТЬNULL(втСумма.СуммаПодъем, 0) КАК СуммаПодъем,
	               |	втСумма.ТочкаДоставки КАК ТочкаДоставки,
	               |	ЕСТЬNULL(втСумма.ФиксТариф, 0) КАК СуммаПоФиксТарифу
	               |ИЗ
	               |	втСумма КАК втСумма
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втРаботники КАК втРаботники
	               |		ПО (втРаботники.Сотрудник = втСумма.Сотрудник)
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(втРаботники.Должность, ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ВодительЗаборщик)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втСумма.Сотрудник.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ вр_РаботникиОрганизации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втРаботники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втРасчетЗППодъем
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втИзРС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втИзЗакрытия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втИзРСсВесом
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втИзРСиЗакрытие
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втДоставкаЗаказВес
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втДанныеЗаказов1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втКолВоВЭкипаже
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втДанныеЗаказов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втЗначенияКатегорииЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втТарифыОсновные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втТарифыФрахт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втЗаборФрахтТД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втЗаказыТД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втЗаказЗона
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втЗаказКатегория
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втЗаказКатегорияЗабора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втПоказатели
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втСумма
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ втФиксНачисления";
	

	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ТерминалДоставки", Объект.Терминал);
	
	ИсключаемыеТипыЗаказов = Новый Массив;
	ИсключаемыеТипыЗаказов.Добавить(Перечисления.ТипыЗаказов.Фрахт);
	Запрос.УстановитьПараметр("ИсключаемыеТипыЗаказов", ИсключаемыеТипыЗаказов);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	//Объект.Данные.Загрузить(Результат.Выгрузить());
	Выборка = Результат.Выбрать();
	ТЗРасширенная  = Новый ТаблицаЗначений;
	ТЗРасширенная.Колонки.Добавить("Сотрудник");
	ТЗРасширенная.Колонки.Добавить("Организация");
	ТЗРасширенная.Колонки.Добавить("Должность");
	ТЗРасширенная.Колонки.Добавить("СуммаОплаты");
	ТЗРасширенная.Колонки.Добавить("СуммаЗаПодъем");
	ТЗРасширенная.Колонки.Добавить("СуммаПоФиксТарифу");
	КолВсего = Выборка.Количество();
	Ном = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Тариф = 0 Тогда
			Если не ЗначениеЗаполнено(Выборка.Категория) Тогда
				Сообщить("Не определена категория в заказе - " + Строка(Выборка.Заказ));
			ИначеЕсли не ЗначениеЗаполнено(Выборка.Территориальность) и Выборка.ТипЗаказа <> ПредопределенноеЗначение("Перечисление.ТипыЗаказов.Фрахт") Тогда
				Сообщить("Не определена территориальность в заказе - " + Строка(Выборка.Заказ));
			ИначеЕсли Выборка.ТипЗаказа = ПредопределенноеЗначение("Перечисление.ТипыЗаказов.Фрахт") Тогда  
				Сообщить("Проверить " + Строка(Выборка.Ссылка) + ", строка " + Строка(Выборка.НомерСтроки));
			Иначе
				Сообщить("Не установлен тариф для набора показателей - " + Строка(Выборка.ТипЗаказа) + ", " + Строка(Выборка.Категория) + ", " + Строка(Выборка.Территориальность) + ", "
				+ Строка(Выборка.ВидТарифаДоставкаЗабор));
			КонецЕсли;
		ИначеЕсли не ЗначениеЗаполнено(Выборка.Заказ) Тогда
			Сообщить("По сотруднику " + Строка(Выборка.Сотрудник) + " нет данных");
		Иначе
			НоваяСтрокаТЧ = ТЗРасширенная.Добавить();
			НоваяСтрокаТЧ.Сотрудник = Выборка.Сотрудник;
			НоваяСтрокаТЧ.Организация = Выборка.Организация;
			НоваяСтрокаТЧ.Должность = Выборка.Должность;
			НоваяСтрокаТЧ.СуммаЗаПодъем = Выборка.СуммаПодъем;
			НоваяСтрокаТЧ.СуммаОплаты = Выборка.Тариф;
			НоваяСтрокаТЧ.СуммаПоФиксТарифу = Выборка.СуммаПоФиксТарифу
			
		КонецЕсли;
		Ном = Ном + 1;
		//Состояние(Строка(Ном) + " / " + Строка(КолВсего));
	КонецЦикла;
	
	ТЗРасширенная.Свернуть("Сотрудник, Организация, Должность, СуммаПоФиксТарифу", "СуммаОплаты, СуммаЗаПодъем");
	Объект.Данные.Загрузить(ТЗРасширенная);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(МесяцСтрока, Объект.ПериодРегистрации);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	// Заполним реквизит формы МесяцСтрока.
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(ТекущиеДанные.Сотрудник);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			ТекущиеДанные.Организация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
		
КонецПроцедуры


&НаКлиенте
Процедура Расшифровать(Команда)
	
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		//ТекущиеДанные.Сотрудник;
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Каламала", "ЗначениеКал");
		ПараметрыОткрытия.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
		ОткрытьФорму("Отчет.мгОтчетПоСдельнойОплате.Форма", ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры
